integration/02-waveFlume_cnoidal_h0.1m_4cmX1cm/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            IH_Waves_InletVelocityV2;
        waveDict        IHWavesDict;
        value           uniform (0 0 0);

	leftORright	1.0;
    }

    outlet
    {
        type            IH_3D_3DAbsorption_InletVelocityV2;
        nPaddles        1;
        value           uniform (0 0 0);

	leftORright	-1.0;
    }

    sides
    {
	type            empty;
    }

    ground
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
